Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: WhatsApp runs through a local bridge helper speaking the WhatsApp Web protocol, linked to your own account like a browser session — no bot account, token, or Meta Business setup. This uses an unofficial protocol: WhatsApp may log the session out, and a dedicated number is recommended.
ko: WhatsApp는 WhatsApp Web 프로토콜을 사용하는 로컬 브리지 헬퍼를 통해 실행되며, 브라우저 세션처럼 본인 계정에 연결됩니다 — 봇 계정, 토큰, Meta Business 설정이 필요 없습니다. 비공식 프로토콜을 사용하므로 WhatsApp가 세션을 로그아웃시킬 수 있으며, 전용 번호 사용을 권장합니다.
ru: WhatsApp работает через локальный мост-помощник, использующий протокол WhatsApp Web и привязанный к вашему собственному аккаунту, как сессия браузера — без бот-аккаунта, токена или настройки Meta Business. Используется неофициальный протокол: WhatsApp может завершить сессию, рекомендуется выделенный номер.
zh_hans: WhatsApp 通过本地桥接辅助程序运行，该程序使用 WhatsApp Web 协议，像浏览器会话一样关联到你自己的账号 — 无需机器人账号、令牌或 Meta Business 设置。这使用非官方协议：WhatsApp 可能会注销该会话，建议使用专用号码。

source: WhatsApp settings saved
ko: WhatsApp 설정이 저장됨
ru: Настройки WhatsApp сохранены
zh_hans: WhatsApp 设置已保存

source: WhatsApp settings saved — receive is ready
ko: WhatsApp 설정이 저장됨 — 수신 준비 완료
ru: Настройки WhatsApp сохранены — приём готов
zh_hans: WhatsApp 设置已保存 — 接收已就绪

source: When enabled, Osaurus will continuously listen for agent names. Say a agent's name to automatically open a chat with that agent.
ko: 이 기능을 사용하면 Osaurus가 에이전트의 이름을 지속적으로 수신합니다. 에이전트의 이름을 말하면 해당 에이전트와의 채팅이 자동으로 열립니다.
ru: Если этот параметр включен, Osaurus будет постоянно прослушивать имена агентов. Произнесите имя агента, чтобы автоматически открыть чат с этим агентом.
zh_hans: 启用后，Osaurus 将持续聆听智能体的名称。说出某个智能体的名称即可自动打开与该智能体的聊天。
zh_hant: 啓用後，Osaurus 將持續聆聽智能體的名稱。說出某個智能體的名稱即可自動打開與該智能體的聊天。

source: When enabled, press the hotkey to start transcribing. Your voice will be typed directly into the focused text field in any application.
ko: 이 기능을 사용하면 단축키를 눌러 텍스트 변환을 시작할 수 있습니다. 사용자의 음성이 모든 응용 프로그램의 포커스된 텍스트 필드에 직접 입력됩니다.
ru: Когда режим включён, нажмите сочетание клавиш, чтобы начать транскрипцию. Речь будет вводиться прямо в активное текстовое поле любого приложения.
zh_hans: 启用后，按下热键即可开始转写。你的语音将直接输入到任意应用中处于焦点的文本框内。
zh_hant: 啓用後，按下熱鍵即可開始轉錄。你的語音將被直接輸入到任意應用中處於焦點的文本框內。

source: When encryption is on, wiping the macOS Keychain or migrating to a new Mac without iCloud Keychain sync makes encrypted storage unrecoverable. Export a plaintext backup before migrating.
ko: 암호화를 사용하는 경우, macOS 키체인을 삭제하거나 iCloud 키체인 동기화 없이 새로운 Mac으로 마이그레이션하면 암호화된 저장소를 복구할 수 없습니다. 마이그레이션 전에 일반 텍스트 백업을 내보내세요.
ru: Если шифрование включено, очистка связки ключей macOS или переход на новый Mac без синхронизации связки ключей iCloud делает зашифрованное хранилище невозможным. Перед миграцией экспортируйте резервную копию в виде незашифрованного текста.
zh_hans: 当加密开启时，清除 macOS 钥匙串或在没有 iCloud 钥匙串同步的情况下迁移到新 Mac 会使加密存储无法恢复。迁移前请导出明文备份。
zh_hant: 當加密開啓時，清除macOS鑰匙串或在沒有iCloud鑰匙串同步的情況下遷移到新Mac會使加密存儲無法恢復。遷移前請導出明文備份。

source: When off, ALICE, Alice, and alice all match.
ko: 이 기능을 끄면 ALICE, Alice, alice가 모두 일치합니다.
ru: Когда выключено, ALICE, Алиса и Алиса совпадают.
zh_hans: 关闭时，ALICE、Alice 和 alice 都匹配。
zh_hant: 關閉時，ALICE、Alice 和 alice 都匹配。

source: When off, Osaurus pins the BatchEngine to one active slot even if Concurrent Sessions is higher.
ko: 이 기능을 끄면 동시 세션 수가 더 높더라도 Osaurus가 BatchEngine을 하나의 활성 슬롯에 고정합니다.
ru: Если параметр Osaurus выключен, он закрепляет BatchEngine в одном активном слоте, даже если число одновременных сеансов выше.
zh_hans: 当此选项关闭时，即使并发会话数设置得更高，Osaurus 也会将批量引擎固定为一个活动槽位。
zh_hant: 當此選項關閉時，即使並發會話數設置得更高，Osaurus 也會將批量引擎固定爲一個活動槽位。

source: When the agent wants to post
ko: 에이전트가 게시하려고 할 때
ru: Когда агент хочет опубликовать
zh_hans: 当智能体想要发帖时
zh_hant: 當智能體想要發文時

source: When to evict a loaded model from RAM, and how long to keep it warm after the last request.
ko: RAM에서 로드된 모델을 제거할 시기와 마지막 요청 이후 웜 상태를 유지할 기간입니다.
ru: Когда выгружать модель из ОЗУ и как долго держать её в памяти после последнего запроса.
zh_hans: 何时将已加载模型从内存中驱逐，以及在最后一次请求后保温多久。
zh_hant: 何時將已加載模型從內存中驅逐，以及在最後一次請求後保溫多久。

source: When to use
ko: 사용 시점
ru: Когда использовать
zh_hans: 何时使用
zh_hant: 何時使用

source: When you add credits or use an Osaurus Router model, it shows up here with its amount. If this Mac made a request, you can jump to the chat or Insights.
ko: 크레딧을 추가하거나 Osaurus Router 모델을 사용하면 금액과 함께 여기에 표시됩니다. 이 Mac에서 요청을 한 경우 채팅 또는 Insights로 바로 이동할 수 있습니다.
ru: Когда вы пополняете баланс или используете модель Osaurus Router, это отображается здесь с суммой. Если запрос был сделан с этого Mac, можно перейти к чату или Insights.
zh_hans: 当你添加积分或使用 Osaurus Router 模型时，它会连同金额显示在这里。如果这台 Mac 发出过请求，你可以跳转到对应聊天或洞察。
zh_hant: 當您添加積分或使用Osaurus路由器模型時，它會連同金額顯示在這裡。如果這臺 Mac 提出了請求，您可以跳轉到聊天或 Insights。

source: When you turn it on for an agent, Computer Use lets that agent operate macOS apps for you — working through a goal step by step and showing every action in a live feed.
ko: 에이전트에 대해 이 기능을 켜면 컴퓨터 제어 기능을 통해 해당 에이전트가 사용자를 대신하여 macOS 앱을 조작할 수 있습니다. 단계별로 목표를 수행하며 모든 작업을 실시간 피드에 표시합니다.
ru: Когда вы включаете эту функцию для агента, «Использование компьютера» позволяет этому агенту управлять приложениями macOS для вас, шаг за шагом достигая цели и показывая каждое действие в прямой трансляции.
zh_hans: 为智能体开启此功能后，电脑操控即可让该智能体替你操作 macOS 应用程序——它会分步骤完成目标，并在实时动态中展示每一个动作。
zh_hant: 爲智能體開啓此功能後，電腦操作即可讓該智能體替您操作 macOS 應用程序——它會分步驟完成目標，並在實時動態中展示每一個動作。

source: When you use an Osaurus Router model, each request shows up here with its cost and tokens. If this Mac made the request, you can jump to the chat or Insights.
ko: Osaurus Router 모델을 사용하면 각 요청이 비용 및 토큰과 함께 여기에 표시됩니다. 이 Mac에서 요청을 한 경우 채팅 또는 인사이트로 바로 이동할 수 있습니다.
ru: Когда используется модель Osaurus Router, каждый запрос отображается здесь со стоимостью и токенами. Если запрос был сделан с этого Mac, можно перейти к чату или Insights.
zh_hans: 当你使用 Osaurus 路由器模型时，每个请求都会连同其成本和令牌数显示在这里。如果这台 Mac 发出过请求，你可以跳转到聊天或洞察。
zh_hant: 當您使用Osaurus路由器模型時，每個請求都會顯示在其成本和令牌上。如果這臺 Mac 提出了請求，您可以跳轉到聊天或 Insights。

source: When your dino installs packages, runs scripts, or fiddles with files, it does that in a tiny, walled-off workspace — separate from your Mac.
ko: 다이노가 패키지를 설치하거나 스크립트를 실행하거나 파일을 수정할 때 Mac과 분리된 작고 격리된 작업 공간에서 작업을 수행합니다.
ru: Когда динозавр устанавливает пакеты, запускает сценарии или работает с файлами, всё происходит в небольшой изолированной рабочей области отдельно от Mac.
zh_hans: 当你的小恐龙安装软件包、运行脚本或摆弄文件时，它会在一个微小的、与外界隔离的工作区中完成——与你的 Mac 相分离。
zh_hant: 當你的小恐龍安裝軟件包、運行腳本或擺弄文件時，它會在一個微小的、與外界隔離的工作區中完成——與你的 Mac 相分離。

source: Where do I get my key?
ko: 키는 어디서 받을 수 있나요?
ru: Где я могу получить ключ?
zh_hans: 我在哪里获取我的密钥？
zh_hant: 我在哪裡獲取我的密鑰？

source: Where Osaurus listens for client requests. Changes restart the server.
ko: Osaurus가 클라이언트 요청을 수신하는 위치입니다. 변경 시 서버가 다시 시작됩니다.
ru: Где Osaurus прослушивает запросы клиентов. Изменения перезапускают сервер.
zh_hans: Osaurus 监听客户端请求的位置。更改会重启服务端。
zh_hant: Osaurus監聽客戶端請求的地方。更改後需要重啓服務器。

source: Where the agent posts. The bot must be allowed to post there.
ko: 에이전트가 게시하는 위치입니다. 봇이 그곳에 게시할 수 있어야 합니다.
ru: Куда публикует агент. Боту должно быть разрешено публиковать там.
zh_hans: 智能体发帖的位置。机器人必须获准在那里发帖。
zh_hant: 智能體發文的位置。機器人必須獲准在那裡發文。

source: Where this agent replies on Discord, Slack, and Telegram — and where it may start messages of its own.
ko: 이 에이전트가 Discord, Slack, Telegram에서 답장하는 위치와 스스로 메시지를 시작할 수 있는 위치입니다.
ru: Где этот агент отвечает в Discord, Slack и Telegram — и где он может начинать собственные сообщения.
zh_hans: 此智能体在 Discord、Slack 和 Telegram 上回复的位置——以及它可以主动发起消息的位置。
zh_hant: 此智能體在 Discord、Slack 和 Telegram 上回覆的位置——以及它可以主動發起訊息的位置。

source: Where this agent replies on Discord, Slack, Telegram, and iMessage — and where it may start messages of its own.
ko: 이 에이전트가 Discord, Slack, Telegram, iMessage에서 답장하는 위치와 스스로 메시지를 시작할 수 있는 위치입니다.
ru: Где этот агент отвечает в Discord, Slack, Telegram и iMessage — и где он может начинать собственные сообщения.
zh_hans: 此智能体在 Discord、Slack、Telegram 和 iMessage 上回复的位置，以及它可以主动发起消息的位置。
zh_hant: 此智能體在 Discord、Slack、Telegram 和 iMessage 上回覆的位置，以及它可以主動發起訊息的位置。

source: Where toasts appear on screen
ko: 화면에 토스트가 표시되는 위치
ru: Где на экране появляются всплывающие уведомления
zh_hans: Toast 在屏幕上的显示位置
zh_hant: Toast 在屏幕上的顯示位置

source: Where your dino runs anything that touches your system.
ko: 다이노가 시스템에 영향을 미치는 모든 것을 실행하는 위치입니다.
ru: Где ваш динозавр запускает все, что касается вашей системы.
zh_hans: 你的小恐龙在这里运行任何会接触到你系统的内容。
zh_hant: 你的小恐龍在這裏運行任何會接觸到你係統的內容。

source: Which kinds of agent runs may post here. Replies to incoming messages are separate and unaffected.
ko: 어떤 유형의 에이전트 실행이 여기에 게시할 수 있는지 정합니다. 수신 메시지에 대한 답장은 별개이며 영향을 받지 않습니다.
ru: Какие типы запусков агента могут публиковать здесь. Ответы на входящие сообщения настраиваются отдельно и не затрагиваются.
zh_hans: 哪些类型的智能体运行可以在此发帖。对传入消息的回复是独立的，不受影响。
zh_hant: 哪些類型的智能體執行可以在此發文。對傳入訊息的回覆是獨立的，不受影響。

source: Who can call your API and how aggressively.
ko: API를 호출할 수 있는 사람과 적극성 정도입니다.
ru: Кто может вызывать ваш API и с какой интенсивностью.
zh_hans: 谁可以调用你的 API 以及调用的频率。
zh_hant: 誰可以調用您的API以及調用的頻率。

source: Who replies, who may send
ko: 누가 답장하고 누가 보낼 수 있는지
ru: Кто отвечает и кто может отправлять
zh_hans: 谁来回复，谁可发送
zh_hant: 誰來回覆，誰可傳送

source: Why encryption is opt-in
ko: 암호화가 선택 사항인 이유
ru: Почему шифрование является добровольным
zh_hans: 为什么加密是可选的
zh_hant: 爲什麼加密是可選的

source: Why we collect anonymous usage data
ko: 익명 사용 데이터를 수집하는 이유
ru: Почему мы собираем анонимные данные об использовании
zh_hans: 我们为何收集匿名使用数据
zh_hant: 我們爲何收集匿名使用數據

source: Wide
ko: 넓게
ru: Широкий
zh_hans: 宽
zh_hant: 寬

source: Will be a tight fit
ko: 여유 공간이 부족할 수 있습니다
ru: Будет плотно прилегать
zh_hans: 将会比较勉强
zh_hant: 將會比較勉強

source: Will be saved when you accept.
ko: 수락 시 저장됩니다.
ru: Будет сохранено после подтверждения.
zh_hans: 将在你接受时保存。
zh_hant: 將在你接受時保存。

source: Wipes your signature, every agent address, and every access key, including the backup in your iCloud Keychain. Onboarding will start over.
ko: iCloud 키체인의 백업을 포함하여 서명, 모든 에이전트 주소 및 모든 액세스 키를 지웁니다. 시작하기가 다시 시작됩니다.
ru: Удаляет вашу подпись, каждый адрес агента и каждый ключ доступа, включая резервную копию в вашей Связке ключей iCloud. Регистрация начнется заново.
zh_hans: 清除你的签名、每个智能体地址和每个访问密钥，包括你 iCloud 钥匙串中的备份。初始设置将重新开始。
zh_hant: 清除你的籤名、每個智能體地址和每個訪問密鑰，包括你 iCloud 鑰匙串中的備份。初始設置將重新開始。

source: Wiping the macOS Keychain or migrating to a new Mac without iCloud Keychain sync makes encrypted storage unrecoverable. Take a plaintext backup first if you need to migrate.
ko: macOS 키체인을 삭제하거나 iCloud 키체인 동기화 없이 새로운 Mac으로 마이그레이션하면 암호화된 저장소를 복구할 수 없습니다. 마이그레이션해야 하는 경우 먼저 일반 텍스트 백업을 수행하세요.
ru: Очистка связки ключей macOS или переход на новый Mac без синхронизации связки ключей iCloud делает зашифрованное хранилище невосстановимым. Если вам нужно выполнить миграцию, сначала сделайте резервную копию в виде незашифрованного текста.
zh_hans: 清除 macOS 钥匙串，或在未同步 iCloud 钥匙串的情况下迁移到新 Mac，会使加密存储无法恢复。如果你需要迁移，请先进行明文备份。
zh_hant: 清除 macOS 鑰匙串，或在未同步 iCloud 鑰匙串的情況下遷移到新 Mac，會使加密存儲無法恢復。如果你需要遷移，請先進行明文備份。

source: With a working folder, allow reading .env / keys / credentials. Off by default to keep secrets out of the sandbox.
ko: 작업 폴더에서 .env / 키 / 자격 증명 읽기를 허용합니다. 샌드박스에서 비밀을 유지하기 위해 기본적으로 꺼져 있습니다.
ru: При рабочей папке разрешить чтение.env/keys/credentials. По умолчанию отключено, чтобы секреты не попали в песочницу.
zh_hans: 在有工作文件夹时，允许读取 .env / 密钥 / 凭据。默认关闭，以将密钥排除在沙盒之外。
zh_hant: 在有工作文件夾時，允許讀取 .env / 密鑰 / 憑據。默認關閉，以將密鑰排除在沙盒之外。

source: Wording you reuse, like email replies
ko: 이메일 답장처럼 재사용하는 문구
ru: Формулировки для повторного использования, например ответы на письма
zh_hans: 可复用的措辞，例如邮件回复
zh_hant: 可重複使用的措辭，例如電子郵件回覆

source: Work
ko: 작업
ru: Работа
zh_hans: 工作
zh_hant: 工作

source: Worked
ko: 작업 완료
ru: Завершено
zh_hans: 已处理
zh_hant: 已處理

source: Worked for
ko: 작업 시간
ru: Работал в течение
zh_hans: 处理用时
zh_hant: 處理用時

source: Worker tools
ko: 워커 도구
ru: Инструменты воркеров
zh_hans: 工作代理工具
zh_hant: 工作代理工具

source: Working
ko: 작업 중
ru: Работающий
zh_hans: 正在处理
zh_hant: 正在處理

source: Working directory
ko: 작업 디렉터리
ru: Рабочий каталог
zh_hans: 工作目录
zh_hant: 工作目錄

source: Working Directory
ko: 작업 디렉터리
ru: Рабочий каталог
zh_hans: 工作目录
zh_hant: 工作目錄

source: Working folder is read-only in sandbox mode — code runs in the sandbox
ko: 샌드박스 모드에서 작업 폴더는 읽기 전용입니다 — 코드는 샌드박스에서 실행됩니다
ru: Рабочая папка доступна только для чтения в режиме песочницы — код выполняется в песочнице.
zh_hans: 在沙盒模式下工作文件夹为只读——代码在沙盒中运行
zh_hant: 在沙盒模式下工作文件夾爲只讀——代碼在沙盒中運行

source: Working...
ko: 작업 중...
ru: Работаю...
zh_hans: 处理中...
zh_hant: 處理中...

source: Workspace
ko: 작업 공간
ru: Рабочая область
zh_hans: 工作区
zh_hant: 工作空間

source: Workspace Folder
ko: 작업 공간 폴더
ru: Папка рабочей области
zh_hans: 工作区文件夹
zh_hant: 工作區文件夾

source: Workspace mount
ko: 작업 공간 마운트
ru: Крепление рабочей области
zh_hans: 工作区挂载
zh_hant: 工作空間掛載

source: Write access is disabled for this connection.
ko: 이 연결에는 쓰기 권한이 비활성화되어 있습니다.
ru: Для этого подключения запись отключена.
zh_hans: 此连接已禁用写入权限。
zh_hant: 此連接已停用寫入權限。

source: Write code
ko: 코드 생성
ru: Написать код
zh_hans: 编写代码
zh_hant: 編寫代碼

source: Write code that
ko: 다음 코드를 작성하세요:
ru: Напишите код, который
zh_hans: 编写满足以下要求的代码：
zh_hant: 編寫滿足以下要求的代碼：

source: Write Files
ko: 파일 작성
ru: Запись файлов
zh_hans: 写入文件
zh_hant: 寫入文件

source: Write guidance for the AI... Example: ## When to use this skill - Describe scenarios ## Guidelines - Add specific guidance
ko: AI를 위한 지침을 작성하세요... 예시: ## 이 기술을 사용하는 경우 - 시나리오 설명 ## 지침 - 특정 지침 추가
ru: Напишите руководство для ИИ… Пример: ## Когда использовать этот навык - Описать сценарии. ## Рекомендации - Добавить конкретные рекомендации
zh_hans: 为 AI 编写指导... 示例： ## 何时使用此技能 - 描述适用场景 ## 准则 - 添加具体指导
zh_hant: 爲 AI 編寫指導... 示例： ## 何時使用此技能 - 描述適用場景 ## 準則 - 添加具體指導

source: Write probe failed: %@
ko: 쓰기 프로브 실패: %@
ru: Ошибка записи: %@
zh_hans: 探测写入失败：%@
zh_hant: 探測寫入失敗：%@

source: Writer
ko: 작성자
ru: Писатель
zh_hans: 作家
zh_hant: 作家

source: Writes a plaintext copy of every database, attachment, and config under ~/.osaurus to a folder you choose. Recommended before reinstalling macOS or moving Macs.
ko: ~/.osaurus 아래의 모든 데이터베이스, 첨부 파일 및 설정의 일반 텍스트 사본을 선택한 폴더에 작성합니다. macOS를 다시 설치하거나 Mac을 이동하기 전에 권장됩니다.
ru: Записывает незашифрованную копию каждой базы данных, вложения и конфигурации из ~/.osaurus в выбранную папку. Рекомендуется перед переустановкой macOS или переносом на другой Mac.
zh_hans: 将 ~/.osaurus 下每个数据库、附件和配置的明文副本写入你选择的文件夹。建议在重新安装 macOS 或更换 Mac 前进行。
zh_hant: 將~/.osaurus下的每個數據庫、附件和配置的明文副本寫入您選擇的文件夾。建議在重新安裝 macOS 或移動 Mac 之前使用。

source: Writes limited to the sandbox workspace
ko: 쓰기가 샌드박스 워크스페이스로 제한됨
ru: Запись ограничена рабочей областью песочницы
zh_hans: 写入仅限于沙盒工作区
zh_hant: 寫入僅限於沙盒工作區

source: writes on
ko: 쓰기 가능
ru: пишет на
zh_hans: 撰写于
zh_hant: 撰寫於

source: Writing a file
ko: 파일 작성 중
ru: Написание файла
zh_hans: 正在写入文件
zh_hant: 正在寫入文件

source: Writing a file in sandbox
ko: 샌드박스에서 파일 작성 중
ru: Запись файла в песочнице
zh_hans: 正在沙盒中写入文件
zh_hant: 正在沙盒中寫入文件

source: Wrote a file
ko: 파일을 작성했습니다
ru: Написал файл
zh_hans: 已写入文件
zh_hant: 已寫入文件

source: Wrote a file in sandbox
ko: 샌드박스에 파일을 작성했습니다
ru: Записал файл в песочницу
zh_hans: 已在沙盒中写入文件
zh_hant: 已在沙盒中寫入文件

source: xAI OAuth discovery returned an untrusted %@
ko: xAI OAuth 검색에서 신뢰할 수 없는 %@을(를) 반환했습니다
ru: Обнаружение xAI OAuth вернуло недоверенный %@
zh_hans: xAI OAuth 发现返回了不受信任的 %@
zh_hant: xAI OAuth發現返回了不受信任的%@

source: xAI OAuth tokens are present and refreshed before model discovery.
ko: xAI OAuth 토큰이 존재하며 모델 검색 전에 새로 고침됩니다.
ru: Токены xAI OAuth есть и обновляются перед поиском моделей.
zh_hans: xAI OAuth 令牌存在，并在模型发现之前进行刷新。
zh_hant: xAI OAuth 令牌存在，並在模型發現之前進行刷新。

source: xAI rejected the sign-in callback: %@
ko: xAI에서 로그인 콜백을 거부했습니다: %@
ru: xAI отклонил обратный вызов для входа: %@
zh_hans: xAI 拒绝了登录回调：%@
zh_hant: xAI 拒絕了登錄回調: %@

source: xAI returned an invalid token response during Grok sign-in
ko: Grok 로그인 중 xAI에서 잘못된 토큰 응답을 반환했습니다
ru: xAI вернул неверный ответ токена во время входа в Grok
zh_hans: xAI 在 Grok 登录过程中返回了无效的令牌响应
zh_hant: xAI在Grok登錄過程中返回了無效的令牌響應

source: xAI sign-in required
ko: xAI 로그인 필요
ru: xAI требуется вход
zh_hans: 需要 xAI 登录
zh_hant: 需要xAI登錄

source: xAI signed in
ko: xAI 로그인됨
ru: xAI вошёл в систему
zh_hans: xAI 已登录
zh_hant: xAI已登錄

source: xAI token request failed: %@
ko: xAI 토큰 요청 실패: %@
ru: запрос токена xAI не выполнен: %@
zh_hans: xAI 令牌请求失败：%@
zh_hant: xAI令牌請求失敗：%@

source: Xcode builds need separate grants. Try 'tccutil reset AppleEvents' if stuck.
ko: Xcode 빌드에는 별도의 권한이 필요합니다. 문제가 발생하면 'tccutil reset AppleEvents'를 시도해 보세요.
ru: Сборки Xcode требуют отдельных грантов. Попробуйте «tccutil сброс AppleEvents», если зависло.
zh_hans: Xcode 构建需要单独授权。如果卡住，请尝试 'tccutil reset AppleEvents'。
zh_hant: Xcode 構建需要單獨授權。如果卡住，請嘗試 'tccutil reset AppleEvents'。

source: Yearly
ko: 매년
ru: Ежегодно
zh_hans: 每年
zh_hant: 每年

source: yes
ko: 예
ru: да
zh_hans: 是
zh_hant: 是

source: Yes
ko: 예
ru: Да
zh_hans: 是
zh_hant: 是

source: You
ko: 나
ru: Ты
zh_hans: 你
zh_hant: 你

source: You can change this anytime in Settings → Privacy.
ko: 설정 → 개인정보 보호에서 언제든지 변경할 수 있습니다.
ru: Вы можете изменить это в любое время в «Настройки» → «Конфиденциальность».
zh_hans: 你可以随时在「设置 → 隐私」中更改此设置。
zh_hant: 你可以隨時在「設置 → 隱私」中更改此設置。

source: You can continue — the download keeps going in the background.
ko: 계속 진행해도 됩니다. 다운로드는 백그라운드에서 계속됩니다.
ru: Можно продолжить — загрузка продолжится в фоновом режиме.
zh_hans: 你可以继续——下载会在后台进行。
zh_hant: 你可以繼續——下載會在背景進行。

source: You can keep chatting with Osaurus Cloud.
ko: Osaurus Cloud로 계속 채팅할 수 있습니다.
ru: Вы можете продолжать общение через Osaurus Cloud.
zh_hans: 你可以继续使用 Osaurus Cloud 聊天。
zh_hant: 你可以繼續使用 Osaurus Cloud 聊天。

source: You can rename and customize your dino anytime in Settings.
ko: 설정에서 언제든지 다이노의 이름을 변경하고 사용자화할 수 있습니다.
ru: Вы можете в любое время переименовать и настроить своего динозавра в настройках.
zh_hans: 你可以随时在设置中重命名和自定义你的恐龙。
zh_hant: 你可以隨時在設置中重命名和自定義你的恐龍。

source: You can stop a run at any time from the activity feed in chat.
ko: 채팅의 활동 피드에서 언제든지 실행을 중지할 수 있습니다.
ru: Вы можете остановить пробежку в любой момент из ленты активности в чате.
zh_hans: 你可以随时从聊天中的活动动态停止运行。
zh_hant: 您可以隨時從聊天中的活動動態停止運行。

source: You can try again in %llds.
ko: %lld초 후에 다시 시도할 수 있습니다.
ru: Повторить попытку можно через %lld с.
zh_hans: %lld 秒后可重试。
zh_hant: %lld 秒後可重試。

source: You may be asked to authenticate to sign the upload.
ko: 업로드에 서명하기 위해 인증을 요구받을 수 있습니다.
ru: Вас могут попросить пройти аутентификацию, чтобы подписать загрузку.
zh_hans: 系统可能会要求你进行身份验证以签署此次上传。
zh_hant: 系統可能會要求你進行身份驗證以籤署此次上傳。

source: You stay in control
ko: 모든 권한은 직접 제어
ru: Всё под вашим контролем
zh_hans: 控制权始终在你手中
zh_hant: 控制權始終在你手中

# You were charged %@ for %d tokens.
source: You were charged %1$@ for %2$d tokens.
ko: 토큰 %2$d개에 대해 %1$@이(가) 청구되었습니다.
ru: С вас было списано %1$@ за %2$d токенов.
zh_hans: 本次已扣费 %1$@（共 %2$d 个 Token）。
zh_hant: 您被收取了%1$@個%2$d詞元的費用。

source: You were charged %@.
ko: %@이(가) 청구되었습니다.
ru: С вас было списано %@.
zh_hans: 本次已扣费 %@。
zh_hant: 您被收取了%@。

# You were renaming a conversation titled "%@" to "%@" but haven't saved it yet.
source: You were renaming a conversation titled "%1$@" to "%2$@" but haven't saved it yet.
ko: "%1$@" 제목의 대화를 "%2$@"(으)로 이름 변경 중이었지만 아직 저장하지 않았습니다.
ru: Вы переименовывали диалог «%1$@» в «%2$@», но ещё не сохранили изменение.
zh_hans: 你正在将标题为“%1$@”的对话重命名为“%2$@”，但尚未保存。
zh_hant: 你正在將標題爲「%1$@」的對話重命名爲「%2$@」，但尚未保存。

source: You'll add %@
ko: %@을(를) 추가하게 됩니다
ru: Вы добавите %@
zh_hans: 你将添加 %@
zh_hant: 您將新增%@

source: You’re all set
ko: 준비 완료
ru: Всё готово
zh_hans: 一切就绪
zh_hant: 一切就緒

source: You're already set up
ko: 이미 설정이 완료되었습니다
ru: Всё уже настроено
zh_hans: 你已经设置完毕
zh_hant: 你已經設置完畢

source: You're out of credits
ko: 크레딧이 부족합니다
ru: У тебя закончились кредиты
zh_hans: 你的积分已用完
zh_hant: 你的積分已用完

source: Your API key is stored in your macOS Keychain and only sent to %@.
ko: API 키는 macOS 키체인에 저장되며 %@에만 전송됩니다.
ru: Ваш ключ API хранится в Связке ключей macOS и отправляется только на %@.
zh_hans: 你的 API 密钥存储在你的 macOS 钥匙串中，且仅发送给 %@。
zh_hant: 你的 API 密鑰存儲在你的 macOS 鑰匙串中，且僅發送給 %@。

source: Your API key never leaves your device.
ko: API 키는 기기 외부로 절대 유출되지 않습니다.
ru: Ваш ключ API никогда не покидает ваше устройство.
zh_hans: 你的 API 密钥永远不会离开你的设备。
zh_hant: 你的 API 密鑰永遠不會離開你的設備。

source: Your API keys are stored securely in Keychain.
ko: API 키는 키체인에 안전하게 저장됩니다.
ru: API-ключи безопасно хранятся в Связке ключей.
zh_hans: 你的 API 密钥会安全存储在钥匙串中。
zh_hant: 你的 API 密鑰會安全存儲在鑰匙串中。

source: Your balance is %@. Add credits to keep chatting.
ko: 잔액은 %@입니다. 채팅을 계속하려면 크레딧을 추가하세요.
ru: Ваш баланс составляет %@. Добавьте кредиты, чтобы продолжить общение.
zh_hans: 你的余额是 %@。添加积分以继续聊天。
zh_hant: 您的餘額是%@。添加積分以繼續聊天。

source: Your balance is now %@. Retry your last message to continue.
ko: 현재 잔액은 %@입니다. 계속하려면 마지막 메시지를 다시 시도하세요.
ru: Ваш баланс теперь %@. Повторите последнее сообщение, чтобы продолжить.
zh_hans: 你的余额现在是 %@。重试你最后一条消息以继续。
zh_hant: 您的餘額現在是%@。重試您最後一條消息以繼續。

source: Your balance. %@ spent this session. Click to add credits.
ko: 잔액입니다. 이 세션에서 %@을(를) 사용했습니다. 클릭하여 크레딧을 추가하세요.
ru: Ваш баланс. За этот сеанс потрачено %@. Нажмите, чтобы пополнить.
zh_hans: 你的余额。本会话已花费 %@。点击添加积分。
zh_hant: 您的餘額。本會話已花費%@。點擊添加積分。

source: Your balance. Click to add credits.
ko: 잔액입니다. 클릭하여 크레딧을 추가하세요.
ru: Ваш баланс. Нажмите, чтобы добавить кредиты.
zh_hans: 你的余额。点击添加积分。
zh_hant: 您的餘額。點擊添加積分。

source: Your chats stay private and work offline. We picked the best fit for this Mac — all you have to do is download it.
ko: 채팅은 비공개로 유지되며 오프라인에서도 작동합니다. 이 Mac에 가장 잘 맞는 모델을 골랐으니 다운로드만 하면 됩니다.
ru: Ваши чаты остаются приватными и работают офлайн. Мы подобрали лучший вариант для этого Mac — осталось только загрузить его.
zh_hans: 聊天保持私密，并可离线使用。我们已为这台 Mac 选好最合适的模型，你只需下载即可。
zh_hant: 聊天保持私密，並可離線使用。我們已為這臺 Mac 選好最合適的模型，你只需下載即可。

source: Your chats, prompts, files, and keys never leave your Mac.
ko: 사용자의 채팅, 프롬프트, 파일 및 키는 Mac 외부로 절대 전송되지 않습니다.
ru: Ваши чаты, промпты, файлы и ключи никогда не покинут ваш Mac.
zh_hans: 你的聊天、提示词、文件和密钥绝不会离开你的 Mac。
zh_hant: 你的聊天、提示詞、檔案和密鑰絕不會離開你的 Mac。

source: Your Client Secret is stored in your macOS Keychain and only sent to %@.
ko: 클라이언트 시크릿(Client Secret)은 macOS 키체인에 저장되며 %@에만 전송됩니다.
ru: Ваш секрет клиента хранится в вашей Связке ключей macOS и отправляется только на %@.
zh_hans: 你的客户端密钥存储在你的 macOS 钥匙串中，且仅发送给 %@。
zh_hant: 你的客戶端密鑰存儲在你的 macOS 鑰匙串中，且僅發送給 %@。

source: Your code is checked securely when you redeem.
ko: 코드를 사용할 때 안전하게 확인합니다.
ru: При активации код проверяется безопасным способом.
zh_hans: 兑换时会安全地验证你的代码。
zh_hant: 兌換時會安全地驗證你的代碼。

source: Your code was accepted.
ko: 코드가 승인되었습니다.
ru: Код принят.
zh_hans: 代码已接受。
zh_hant: 代碼已接受。

source: Your current Master Key no longer matches the addresses your agents and access keys were derived from. This usually means a Master Key was created on top of an existing one — for example, by a re-run of onboarding.
ko: 현재 마스터 키가 에이전트 및 액세스 키가 파생된 주소와 더 이상 일치하지 않습니다. 이는 일반적으로 시작하기를 다시 실행하는 등의 이유로 기존 마스터 키 위에 새 마스터 키가 생성되었음을 의미합니다.
ru: Ваш текущий главный ключ больше не соответствует адресам, из которых были получены ваши агенты и ключи доступа. Обычно это означает, что мастер-ключ был создан поверх существующего — например, в результате повторного запуска онбординга.
zh_hans: 你当前的主密钥不再与你的智能体和访问密钥所派生的地址相匹配。这通常意味着在现有主密钥之上又创建了一个主密钥——例如，由于重新执行了初始设置。
zh_hant: 你當前的主密鑰不再與你的智能體和訪問密鑰所派生的地址相匹配。這通常意味著在現有主密鑰之上又創建了一個主密鑰——例如，由於重新執行了初始設置。

source: Your customization is removed. If the room is still writable and this agent still answers there, it returns to Automatic — the agent asks before every post.
ko: 사용자화가 제거됩니다. 룸이 여전히 쓰기 가능하고 이 에이전트가 계속 그곳에서 답장한다면 자동 상태로 돌아가며, 에이전트는 게시할 때마다 먼저 물어봅니다.
ru: Ваша настройка будет удалена. Если комната по-прежнему доступна для записи и этот агент всё ещё отвечает там, она вернётся в режим «Автоматически» — агент будет спрашивать перед каждым постом.
zh_hans: 你的自定义将被移除。如果房间仍可写入且此智能体仍在那里回复，它会恢复为“自动”——智能体每次发帖前都会先询问。
zh_hant: 您的自訂將被移除。如果房間仍可寫入且此智能體仍在那裡回覆，它會恢復為「自動」——智能體每次發文前都會先詢問。
